drop database if exists library;
create database library char set utf8;

use library;

create table books (
    id int not null primary key auto_increment,
    book_title varchar(120) not null,
    description varchar(1000) default 'Опис відсутній',
    publication_date date not null default '2018-01-01',
    author varchar(60) not null,
    category varchar(30) not null
);

insert into books (book_title, author, category)
    values
        ('Інферно', 'Ден Браун', 'Роман'),
        ('Трансформація української національної ідеї', 'Олесь Доній', 'Суспільно-політична література'),
        ('Голодні ігри', 'Сьюзен Коллінз', 'Пригоди');

insert into books (book_title, author, category, publication_date)
    values
        ('Відьмак', 'Анджей Сапковський', 'Фентезі', '2017-01-08'),
        ('Гаррі Поттер і філософський камінь', 'Джоан Роулінг', 'Фентезі', '2016-12-21'),
		('Дилер реальності', 'Ніколас Дімітров', 'Кіберпанк', '2019-10-08'),
        ('Спустошення', 'Любко Дереш', 'Культура', '2017-07-12');

insert into books (book_title, author, category, publication_date, description)
    values
        ('Хроніки Дюни', 'Френк Герберт', 'Пригоди', '2017-11-12', 'Прянощі — ключ до довголіття та міжгалактичним подорожам. Той, хто контролює прянощі, контролює весь світ.'),
        ('Перезавантаження', 'ФТері Террі', 'Антиутопія', '2018-03-12', 'Психологічний трилер про світ, що у майбутньому опинився під владою несправедливості й тиранії.'),
        ('Террор', 'Ден Сіммонс', 'Фензезі. Пригоди', '2016-07-23', 'У 1845 році експедиція під командуванням досвідченого полярного дослідника сера Джона Франкліна відправляється на суднах "Терор" і "Еребус" до північного узбережжя Канади на пошук Північно-Західного проходу з Атлантичного океану в Тихий - і безслідно зникає. Пошуки її затягнулися на декілька десятиліть.');
        
select * from books;
